Repository: Fing-Technology/R7.Documents
Catalog: R7.Documents/App_LocalResources/ChangeFolder.ascx.*.resx
Languages: ru_ru

# labelInfo.Text
source: Then you click "Update" button, for each document's file in the module a file with the same name will be searched in the folder, choosen below. If there are no such file, a document could be unpublished, deleted, or delete with associated resources.
ru_ru: При нажатии на кнопку "Применить", для каждого файла, связанного с документом в модуле, будет предпринята попытка найти файл с таким же именем в указанной ниже папке. Если такой файл не будет найден, соответствующий документ может быть снят с публикации, удален, или удален вместе со связанными ресурсами. Также можно указать, следует ли публиковать обновленные документы и удалять (или нет) старые файлы.

# labelFolder.Text
source: Folder
ru_ru: Папка

# labelFolder.Help
source: Please select a folder to search files in.
ru_ru: Выберите папку для поиска файлов в ней.

# labelOldFilesAction.Text
source: Updated Old Files
ru_ru: Что делать со старыми файлами

# labelOldFilesAction.Help
source: Specify an action to apply to the old files, for which corresponding file was found in the target folder. You can choose to keep them or delete. In the last case, file will be deleted only then it isn't referenced by other documents.
ru_ru: Выберите действие, которое нужно применить к файлам документов, для которых были найдены соответствующие файлы в целевой папке. Доступные варианты: оставить или удалить. В последнем случае, файл будет удален только тогда, когда на него не ссылаются другие документы.

# OldFilesActionKeep.Text
source: Keep
ru_ru: Оставить

# OldFilesActionDelete.Text
source: Delete
ru_ru: Удалить

# labelSkippedAction.Text
source: Skipped Documents
ru_ru: Что делать с пропущенными документами

# labelSkippedAction.Help
source: Specify an action to apply to the documents, for which no corresponding file found in the target folder. You can choose to unpublish them, delete just document entry or delete document entry with accociated resources (files, URLs). In the last case, associated resource will be deleted only then it isn't referenced by other documents.
ru_ru: Выберите действие, которое нужно применить к документам, для которых не были найдены соответствующие файлы в целевой папке. Доступные варианты: снять с публикации, удалить и удалить, включая связанные ресурсы (файлы, ссылки). В последнем случае, связанный ресурс будет удален только тогда, когда на него не ссылаются другие документы.

# SkippedActionDoNothing.Text
source: Do Nothing
ru_ru: Ничего не делать

# SkippedActionUnpublish.Text
source: Unpublish
ru_ru: Снять с публикации

# SkippedActionDelete.Text
source: Delete
ru_ru: Удалить

# SkippedActionDeleteWithResources.Text
source: Delete with Resources
ru_ru: Удалить с ресурсами

# labelPublishUpdated.Text
source: Publish Updated
ru_ru: Публиковать обновленные документы

# labelPublishUpdated.Help
source: Check to publish all documents, for which corresponding file was found in the target folder.
ru_ru: Отметьте чтобы опубликовать документы, для которых были найдены соответствующие файлы в целевой папке.

# labelUpdateDefaultFolder.Text
source: Update Default Folder
ru_ru: Обновить папку по умолчанию

# labelUpdateDefaultFolder.Help
source: Check to update default folder value in the module settings.
ru_ru: Отметьте, чтобы обновить папку по умолчанию в настройках модуля.
